<template>
  <div class="m-menu" @mouseleave="handleLeav">
    <dl class="nav">
      <dt>全部分类</dt>
      <dd v-for="(item,idx) in menu" :key="idx" @mouseenter="handleEnter">
        <i :class="item.type"></i>
        {{ item.name }}
        <span class="arrow"></span>
      </dd>
    </dl>
    <div class="detail" v-if="kind" @mouseenter="handleDetailEnter">
      <template v-for="(item,idx) in curDetail.child">
        <h4 :key="idx.title">{{ item.title }}</h4>
        <span v-for="(childItem,idx) in item.childArr" :key='idx'>
          {{ childItem }}
        </span>
      </template>
    </div>
  </div>
</template>

<script>
export default {
  name: "Menu",
  data() {
    return {
      kind: '',
      menu: [
        {
          type: "food",
          name: "美食",
          child: [
            {
              title: "美食",
              childArr: [
                "代金券",
                "甜点饮品",
                "火锅自助餐",
                "小吃快餐",
                "日韩料理",
                "西餐",
                "聚餐宴请",
                "烧烤烤肉",
                "东北菜",
                "川湘菜",
                "江浙菜",
                "香锅烤鱼",
                "粤港菜",
                "中式烧烤/烤串",
                "西北菜",
                "咖啡",
                "酒吧",
                "茶馆",
                "云贵菜",
                "其他美食"
              ]
            }
          ]
        },
        {
          type: "takeout",
          name: "外卖",
          child: [
            {
              title: "外卖",
              childArr: ["外卖"]
            }
          ]
        },
        {
          type: "hotel",
          name: "酒店",
          child: [
            {
              title: "酒店",
              childArr: ["代金券", "甜点饮品", "火锅自助餐","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城"]
            }
          ]
        },
        {
          type: "homestay",
          name: "民宿",
          child: [
            {
              title: "酒店",
              childArr: ["代金券", "甜点饮品", "火锅自助餐","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城"]
            }
          ]
        },
        {
          type: "movie",
          name: "猫眼电影",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城"]
            }
          ]
        },
        {
          type: "movie",
          name: "机票 / 火车票",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城"]
            }
          ]
        }
        ,
        {
          type: "movie",
          name: "生活服务",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城"]
            }
          ]
        }
        ,
        {
          type: "homestay",
          name: "丽人 / 美发 / 医学美容",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城"]
            }
          ]
        }
        ,
        {
          type: "hotel",
          name: "结婚 / 婚纱摄影 / 婚宴",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城"]
            }
          ]
        }
        ,
        {
          type: "homestay",
          name: "亲子 / 儿童乐园 / 幼教",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城"]
            }
          ]
        }
        ,
        {
          type: "movie",
          name: "运动健身 / 健身中心",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城"]
            }
          ]
        }
        ,
        {
          type: "homestay",
          name: "家装 / 建材 / 家居",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城"]
            }
          ]
        }
        ,
        {
          type: "movie",
          name: "学习培训 / 音乐培训",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城"]
            }
          ]
        }
        ,
        {
          type: "homestay",
          name: "医疗健康 / 宠物 / 爱车",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城"]
            }
          ]
        },
        {
          type: "food",
          name: "酒吧 / 密室逃脱",
          child: [
            {
              title: "酒店",
              childArr: ["万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城","万达影城","耀莱成龙国际影城","大地影院保利国际影城","博纳国际影城"]
            }
          ]
        }
      ]
    };
  },
  computed: {
    curDetail() {
      return this.menu.filter(item => item.type === this.kind)[0];
    }
  },
  methods: {
    handleEnter(e){
      this.kind = e.target.getElementsByTagName('i')[0].className
    },
    handleLeav(){
      setTimeout(() => {
        this.kind = ""
      },200)
    },
    handleDetailEnter(){
      
    },
    handleDetailLavle(){

    }
  }
};
</script>

<style lang="scss" scoped>
</style>